𝓬𝓵𝓪𝓼𝓼 𝓢𝓸𝓵𝓾𝓽𝓲𝓸𝓷:
    𝓭𝓮𝓯 𝓶𝓪𝔁𝓲𝓶𝓪𝓵𝓡𝓮𝓬𝓽𝓪𝓷𝓰𝓵𝓮(𝓼𝓮𝓵𝓯, 𝓶𝓪𝓽𝓻𝓲𝔁: 𝓛𝓲𝓼𝓽[𝓛𝓲𝓼𝓽[𝓼𝓽𝓻]]) -> 𝓲𝓷𝓽:
        𝓲𝓯 𝓷𝓸𝓽 𝓶𝓪𝓽𝓻𝓲𝔁:
            𝓻𝓮𝓽𝓾𝓻𝓷 0

        𝓻𝓸𝔀𝓼, 𝓬𝓸𝓵𝓼 = 𝓵𝓮𝓷(𝓶𝓪𝓽𝓻𝓲𝔁), 𝓵𝓮𝓷(𝓶𝓪𝓽𝓻𝓲𝔁[0])
        𝓽𝓮𝓶𝓹 = [0] * (𝓬𝓸𝓵𝓼 + 1)
        𝓶𝓪𝔁_𝓪𝓻𝓮𝓪 = 0

        𝓯𝓸𝓻 𝓲 𝓲𝓷 𝓻𝓪𝓷𝓰𝓮(𝓻𝓸𝔀𝓼):
            𝓯𝓸𝓻 𝓳 𝓲𝓷 𝓻𝓪𝓷𝓰𝓮(𝓬𝓸𝓵𝓼):
                𝓲𝓯 𝓶𝓪𝓽𝓻𝓲𝔁[𝓲][𝓳] == '1':
                    𝓽𝓮𝓶𝓹[𝓳] += 1
                𝓮𝓵𝓼𝓮:
                    𝓽𝓮𝓶𝓹[𝓳] = 0

            𝓼𝓽𝓴 = []
            𝓯𝓸𝓻 𝓴 𝓲𝓷 𝓻𝓪𝓷𝓰𝓮(𝓵𝓮𝓷(𝓽𝓮𝓶𝓹)):
                𝔀𝓱𝓲𝓵𝓮 𝓼𝓽𝓴 𝓪𝓷𝓭 𝓽𝓮𝓶𝓹[𝓼𝓽𝓴[-1]] > 𝓽𝓮𝓶𝓹[𝓴]:
                    𝓱 = 𝓽𝓮𝓶𝓹[𝓼𝓽𝓴.𝓹𝓸𝓹()]
                    𝔀 = 𝓴 𝓲𝓯 𝓷𝓸𝓽 𝓼𝓽𝓴 𝓮𝓵𝓼𝓮 𝓴 - 𝓼𝓽𝓴[-1] - 1
                    𝓶𝓪𝔁_𝓪𝓻𝓮𝓪 = 𝓶𝓪𝔁(𝓶𝓪𝔁_𝓪𝓻𝓮𝓪, 𝓱 * 𝔀)
                𝓼𝓽𝓴.𝓪𝓹𝓹𝓮𝓷𝓭(𝓴)

        𝓻𝓮𝓽𝓾𝓻𝓷 𝓶𝓪𝔁_𝓪𝓻𝓮𝓪
